namespace HomeworksStudent.TryCatchFinaly
{
    public class EntryTryCatch : IEntryPoint
    {
        public void Start()
        {
            int[] ints = new int[10];

            try
            {
                ints[1] = 123;
            }
            catch (Exception)
            {
                Console.WriteLine("Не получилось");
            }
            finally
            {
                Console.WriteLine("Точно!");
            }

            foreach (var item in ints)
            {
                Console.WriteLine(item);
            }
        }
    }
}

//Консольное приложение на несколько аккаунтов
//При входе в программу, нас встречает окно С приветствием, которое
//предлагает:
//1 - Ввести Логин
//2 - Создать нового пользователя
//Вариант с логином:
//Выскакивает сообщение которое запрашивает логин если такой логин
//есть то предлагает ввести пароль, если логина нет, то говорит об этом
//и до бесконечности запрашивает логин. Если логин введён верно, то
//запрашивает пароль, если пароль введён не верно, то начинается отсчёт
//попыток, после 3х неудачных попыток, пользователь возвращается к вводу
//логина Если пароль введён правильно, то выводит сообщение о том, что
//логин и пароль введены правильно и пускает нас в аккаунт 

//Само приложение представляет собой менеджер задач, в него можно:
//1 - Добавить задачу (Задачи должны иметь формат "Имя задачи",
//"Описание задачи", "Дата добавления задачи")
//2 - Удалить задачу (Появляется список из всех задач и по
//номеру можно удалить задачу)
//3 - Просмотреть все задачи (Выводит список из всех задач с
//указанием их названия, я могу выбрать конкретную задачу и просмотреть
//о ней подробную информацию (Имя, описание, время добавления))
//4 - Удалить все задачи

//Задачи не должны пересекаться между пользователями, у каждого
//пользователя свои задачи