namespace HomeworksStudent.PersonAbstract
{
    public class Task
    {
        //Класс или интерфейс продукта с свойствами:
        //Name, Description, Price.
        //И методом вывода информации.

        //3 класса с 3мя различными, дополнительными полями, 
        //Которые реализуют интерфейс или класс продукта.
        //Пример: (Класс телефона, с полями: 1 - Бренд 2 - Процессор
        //3 - Цвет)
        //В методе вывода информации нужно 
        //выводить полную инфу с доп Полями

        //Класс магазина, который хранит в себе товары, и обрабатывает их
        //Добавляет, удаляет, проверяет наличие, продаёт

        //Сделать меню с выбором, что хочет сделать пользователь,
        //1 - Добавить товар, 2 - Купить товар.
    }
}
