namespace HomeworksStudent.SmartHome
{
    public class SmartHomeStarter : IEntryPoint
    {
        public void Start()
        {
            HomeManager homeManager = new HomeManager();
            homeManager.StartAction<LightOff>();
            Thread.Sleep(2000);
            homeManager.StartAction<LightOn>();
            Thread.Sleep(2000);
            homeManager.StartAction<WaterStart>();
        }
    }
}

//Задача 1
//Система управления заказами в интернет-магазине: 
//Реализовать систему, которая позволяет пользователям добавлять товары в корзину, 
//удалять их, изменять количество и отправлять заказ. 
//Каждая операция (добавление, удаление, отправка заказа(Cw("Отправил"))) 
//должна быть инкапсулирована в отдельный объект команды.
//Корзина должна быть синглетоном.

//Задача 2
//Система управления умным домом
//Команда на включения света
//Команда на выключение света
//Команда на запуск робота пылесоса
//Команда на подачу воды
//Команда на включение сигнализации
//Команда на заказ еды
//Работа команд осуществляется через Console.WriteLine();
//Написать Singletone менеджер, который запускает каждую команду по отдельности